<?php
//for 
//Общее
for ($i = 1; $i <= 10; $i++) {
    echo '<p>'.$i.'</p>';
}
//Перебор массивов
$build = array(
    array(
        'id'    => 1,
        'name'  => 'Met',
        'salt'  => '100001',
    ),
    array(
        'id'    => 2,
        'name'  => 'Krist',
        'salt'  => '200002',
    ),
);

for($i = 0; $i < count($build); ++$i){
    $build[$i]['salt'] = mt_rand(000000, 999999);
}

var_dump($build);
//Задача: Рассматривается множество целых чисел, принадлежащих числовому отрезку [1016; 7937], которые делятся на 3 и не делятся на 7, 17, 19, 27. Найдите количество таких чисел и максимальное из них.
for($i = 1016; $i <= 7937; $i++){
    if(($i % 3 == 0) and ($i % 7 <> 0) and ($i % 17 <> 0) and ($i % 19 <> 0) and ($i % 19 <> 0) and ($i % 27 <> 0)){
        $sum++;
        if($i > $max){
            $max = $i;
        }
    }
}
echo '<p>'.$sum.' '.$max.'</p>';
?>